tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "railwaycat/emacsmacport"
tap "tomanthony/brews"
cask "java"
cask "xquartz"
brew "apache-flink"
brew "autojump"
brew "automake"
brew "blueutil"
brew "boost"
brew "caf"
brew "cfr-decompiler"
brew "cloc"
brew "gmp"
brew "cloog"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctop"
brew "emacs", args: ["HEAD"]
brew "lame"
brew "snappy"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "openssl"
brew "folly"
brew "gcc"
brew "gcc@5"
brew "gcc@6"
brew "gdb"
brew "git"
brew "gmp@4"
brew "gnupg"
brew "pkg-config"
brew "readline"
brew "sqlite"
brew "iperf3"
brew "isl@0.12"
brew "isl@0.14"
brew "ispell"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "libmagic"
brew "libmpc@0.8"
brew "libmpdclient"
brew "librdkafka"
brew "mas"
brew "maven"
brew "mpc"
brew "msgpack"
brew "nasm"
brew "node"
brew "poppler"
brew "pdf2svg"
brew "protobuf"
brew "pyenv"
brew "qt"
brew "rapidjson"
brew "reattach-to-user-namespace"
brew "redis"
brew "rtmpdump"
brew "sbt"
brew "scala"
brew "shadowsocks-libev"
brew "shfmt"
brew "simple-obfs"
brew "svg2png"
brew "tbb"
brew "tcptraceroute"
brew "telnet"
brew "tmux"
brew "tomcat"
brew "tree"
brew "vim"
brew "wakeonlan"
brew "wget"
brew "youtube-dl"
brew "zeromq", args: ["HEAD"]
brew "tomanthony/brews/itermocil"
cask "android-platform-tools"
cask "aria2gui"
cask "font-awesome-terminal-fonts"
cask "font-dejavusansmono-nerd-font"
cask "icloud-control"
cask "iterm2"
cask "java8"
cask "karabiner-elements"
cask "mactex"
cask "owncloud"
cask "shifty"
cask "soundflower"
cask "tuntap"
cask "railwaycat/emacsmacport/emacs-mac"
mas "Adblock Plus", id: 1432731683
mas "Apple Configurator 2", id: 1037126344
mas "Blackmagic Disk Speed Test", id: 425264550
mas "CloudMounter", id: 1130254674
mas "Eudb_en_free", id: 434350458
mas "FolderMarker", id: 1012940117
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "LyricsX", id: 1254743014
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "MineX", id: 1033152947
mas "NeteaseMusic", id: 944848654
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "ToothFairy", id: 1191449274
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
