tap "tomanthony/brews"
tap "railwaycat/emacsmacport"
tap "buo/cask-upgrade"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "d12frosted/emacs-plus"
tap "twlz0ne/cquery"
tap "caskroom/fonts"
tap "caskroom/cask"
cask "java"
cask "xquartz"
brew "apache-spark"
brew "autojump"
brew "automake"
brew "binutils"
brew "boost"
brew "caf"
brew "cfr-decompiler"
brew "cloc"
brew "gmp"
brew "cloog"
brew "cmake"
brew "coreutils"
brew "cquery"
brew "cscope"
brew "ctop"
brew "emacs", restart_service: true
brew "openssl"
brew "xz"
brew "folly"
brew "gcc"
brew "gcc@5"
brew "gcc@6"
brew "gdb"
brew "gmp@4"
brew "gnupg"
brew "pkg-config"
brew "readline"
brew "sqlite"
brew "hadoop"
brew "isl@0.12"
brew "isl@0.14"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "lame"
brew "libmagic"
brew "mpfr@2"
brew "libmpc@0.8"
brew "libmpdclient"
brew "llvm@3.8"
brew "mas"
brew "maven"
brew "mpc"
brew "nasm"
brew "node"
brew "poppler"
brew "pdf2svg"
brew "protobuf"
brew "pyenv"
brew "qemu"
brew "qt"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "rtags"
brew "rtmpdump"
brew "sbt"
brew "scala"
brew "svg2png"
brew "tbb"
brew "telnet"
brew "tmux"
brew "tomcat"
brew "tree"
brew "vim"
brew "wakeonlan"
brew "wget"
brew "x264"
brew "xvid"
brew "zeromq", args: ["HEAD"]
brew "tomanthony/brews/itermocil"
cask "aerial"
cask "android-platform-tools"
cask "iterm2"
cask "karabiner-elements"
cask "mysqlworkbench"
cask "owncloud"
cask "rdm"
cask "shifty"
cask "soundflower"
cask "tuntap"
cask "zerotier-one"
cask "caskroom/fonts/font-awesome-terminal-fonts"
cask "caskroom/fonts/font-dejavusansmono-nerd-font"
cask "railwaycat/emacsmacport/emacs-mac"
mas "Apple Configurator 2", id: 1037126344
mas "Blackmagic Disk Speed Test", id: 425264550
mas "CloudMounter", id: 1130254674
mas "Eudb_en_free", id: 434350458
mas "Evernote", id: 406056744
mas "FolderMarker", id: 1012940117
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LyricsX", id: 1254743014
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "MineX", id: 1033152947
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Remote Desktop", id: 409907375
mas "Shazam", id: 897118787
mas "The Unarchiver", id: 425424353
mas "Tooth Fairy", id: 1191449274
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
