tap "androidports/patch"
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "streamlio/formulae"
tap "tomanthony/brews"
tap "v2ray/v2ray"
brew "autojump"
brew "automake"
brew "blueutil"
brew "icu4c"
brew "boost"
brew "caf"
brew "gettext"
brew "openssl"
brew "readline"
brew "cityhash"
brew "cloc"
brew "gmp"
brew "cloog"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctop"
brew "dnsmasq", restart_service: true
brew "doxygen"
brew "exiftool"
brew "lame"
brew "rtmpdump"
brew "snappy"
brew "xvid"
brew "ffmpeg"
brew "zstd"
brew "folly"
brew "fzf"
brew "gcc"
brew "gcc@5"
brew "gcc@6"
brew "gcc@7"
brew "gcc@8"
brew "gdb"
brew "git"
brew "glib-openssl"
brew "gnupg"
brew "go"
brew "gperf"
brew "gperftools"
brew "httping", link: false
brew "httpstat"
brew "iperf3"
brew "ispell"
brew "jemalloc"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "leiningen"
brew "libmagic"
brew "libmpdclient"
brew "librdkafka"
brew "libtool"
brew "make"
brew "mariadb-connector-c"
brew "mas"
brew "mpc"
brew "msgpack"
brew "nasm"
brew "ninja"
brew "node"
brew "qt"
brew "poppler"
brew "pdf2svg"
brew "peco"
brew "pkg-config"
brew "protobuf"
brew "pyenv"
brew "rapidjson"
brew "reattach-to-user-namespace"
brew "redis"
brew "shfmt"
brew "simple-obfs"
brew "storm"
brew "svg2png"
brew "tbb"
brew "tcptraceroute"
brew "telnet"
brew "tmux"
brew "tree"
brew "vim"
brew "wakeonlan"
brew "wget"
brew "youtube-dl"
brew "zeromq"
brew "tomanthony/brews/itermocil"
brew "v2ray/v2ray/v2ray-core"
cask "font-awesome-terminal-fonts"
cask "font-dejavusansmono-nerd-font"
cask "icloud-control"
cask "iina"
cask "java"
cask "kap"
cask "mactex"
cask "soundflower"
cask "xquartz"
mas "Adblock Plus", id: 1432731683
mas "Apple Configurator 2", id: 1037126344
mas "Disk Speed Test", id: 425264550
mas "FolderMarker", id: 1012940117
mas "GeoTag", id: 1465180184
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "LanScan", id: 472226235
mas "LyricsX", id: 1254743014
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "MineX", id: 1033152947
mas "Noizio", id: 928871589
mas "Notability", id: 736189492
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "Reeder", id: 880001334
mas "ToothFairy", id: 1191449274
mas "微信", id: 836500024
mas "欧路词典", id: 434350458
